#  Data Science Learning Journey  
*Curiosity to Capability — One Notebook at a Time*

---
Compiled and authored by **Partho Sarothi Das**   
	Dhaka, Bangladesh  
	Bachelor's & Master's in Statistics  
	Investment Banking Professional → Aspiring Data Scientist 
    
---

# SQL commands: Five main categories (based on their purpose)

### 1. DDL – Data Definition Language

These commands define or modify the **structure** of the database (tables, schemas, indexes).

| Command      | Purpose                                              | Example                                             |
| ------------ | ---------------------------------------------------- | --------------------------------------------------- |
| **CREATE**   | Create a new table, database, or object.             | `CREATE TABLE students (id INT, name VARCHAR(50));` |
| **ALTER**    | Modify an existing table structure.                  | `ALTER TABLE students ADD age INT;`                 |
| **DROP**     | Delete a table, database, or object.                 | `DROP TABLE students;`                              |
| **TRUNCATE** | Remove all rows from a table but keep the structure. | `TRUNCATE TABLE students;`                          |
| **RENAME**   | Change the name of a database object.                | `RENAME TABLE students TO learners;`                |

---

### 2. DML – Data Manipulation Language

These commands deal with **data inside tables** (insert, update, delete).

| Command    | Purpose                   | Example                                             |
| ---------- | ------------------------- | --------------------------------------------------- |
| **INSERT** | Add new rows of data.     | `INSERT INTO students VALUES (1, 'Partho');`        |
| **UPDATE** | Modify existing data.     | `UPDATE students SET name='Partho Das' WHERE id=1;` |
| **DELETE** | Remove data from a table. | `DELETE FROM students WHERE id=1;`                  |

---

### 3. DQL – Data Query Language

Used for **retrieving data** from the database.

| Command    | Purpose                             | Example                   |
| ---------- | ----------------------------------- | ------------------------- |
| **SELECT** | Query data from one or more tables. | `SELECT * FROM students;` |

---

### 4. DCL – Data Control Language

Deals with **access control and permissions** in the database.

| Command    | Purpose                           | Example                                   |
| ---------- | --------------------------------- | ----------------------------------------- |
| **GRANT**  | Give privileges to a user.        | `GRANT SELECT ON students TO 'user1';`    |
| **REVOKE** | Take back privileges from a user. | `REVOKE SELECT ON students FROM 'user1';` |

---

### 5. TCL – Transaction Control Language

Manages **transactions** in the database to ensure data integrity.

| Command       | Purpose                         | Example              |
| ------------- | ------------------------------- | -------------------- |
| **COMMIT**    | Save changes permanently.       | `COMMIT;`            |
| **ROLLBACK**  | Undo changes since last commit. | `ROLLBACK;`          |
| **SAVEPOINT** | Set a point to roll back to.    | `SAVEPOINT myPoint;` |

---

# DDL – Data Definition Language

### CREATE DATABASE

*Simple*
```SQL
CREATE DATABASE test1
```
*Best practice*

```sql
CREATE DATABASE IF NOT EXISTS test
```

### DELETE DATABASE

*Simple*
```SQL
DROP DATABASE test1
```

*Best practice*

```SQL
DROP DATABASE IF EXISTS test
```

### CREATE TABLE

```SQL
CREATE TABLE users(
	user_id INTEGER,
    name VARCHAR(255),
    email VARCHAR(255),
    password VARCHAR(255)
)
```

**Main constraints in MySQL:**

| Constraint               | Purpose                                                                                                | Example                                            |
| ------------------------ | ------------------------------------------------------------------------------------------------------ | -------------------------------------------------- |
| **NOT NULL**             | Ensures a column cannot have `NULL` values.                                                            | `name VARCHAR(50) NOT NULL`                        |
| **UNIQUE**               | Ensures all values in a column are unique (no duplicates).                                             | `email VARCHAR(100) UNIQUE`                        |
| **PRIMARY KEY**          | Uniquely identifies each row; combination of `NOT NULL` + `UNIQUE`.                                    | `id INT PRIMARY KEY`                               |
| **FOREIGN KEY**          | Links a column in one table to the **PRIMARY KEY** in another table (maintains referential integrity). | `FOREIGN KEY (dept_id) REFERENCES departments(id)` |
| **DEFAULT**              | Sets a default value if none is provided.                                                              | `status VARCHAR(20) DEFAULT 'active'`              |
| **CHECK** *(MySQL 8.0+)* | Ensures values meet a condition.                                                                       | `CHECK (age >= 18)`                                |
| **AUTO\_INCREMENT**      | Automatically generates sequential numbers for a column (usually for primary keys).                    | `id INT PRIMARY KEY AUTO_INCREMENT`                |

**Example Table with Constraints**

```sql
CREATE TABLE employees (
    emp_id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(50) NOT NULL,
    email VARCHAR(100) UNIQUE,
    age INT CHECK (age >= 18),
    dept_id INT,
    status VARCHAR(20) DEFAULT 'active'
    FOREIGN KEY (dept_id) REFERENCES departments(dept_id)
)
```

> You need to create a departments table.

### TRUNCATE TABLE

*Remove All Data but Keep Structure*

```SQL
TRUNCATE TABLE abhik.students
```

### DROP TABLE

```SQL
DROP TABLE IF EXISTS abhik.students
```

### ALTER TABLE

```SQL
ALTER TABLE abhik.employees ADD column city VARCHAR(255) NOT NULL
```

### Drop a column of a table

```SQL
ALTER TABLE abhik.employees DROP COLUMN city
```